-- SQLQuery5-HW-OIT

USE PV_522_ALL_IN_ON;


-- ///////////////////////////////////////////////////////////////////////////
--  Добавление в расписание занятий по ОСновам информационнх технологий

--INSERT INTO Disciplines VALUES	(1, 'Основы информационных технлогий', 24),
--									(2, 'Конфигурирование Windows 10', 32),
--									(3, 'Основы программирования на языке С++', 68),
--									(4, 'Объектно-ориентированное программирование на языке C++', 56),
--									(5, 'UML и паттерны проектирования', 18),
--									(6, 'Платформа Microsoft.NET и язык программирования C#', 34),
--									(7, 'Основы разработки приложений с использованием WindowsForms и WPF', 32),
--									(8, 'Теория баз данных. Программирование MS SQL Server', 24),
--									(9, 'Технолгия доступа к базам данных ADO.NET', 24);

--DELETE FROM Disciplines;
--SELECT * FROM Disciplines; 

--SELECT * FROM Teachers; 

--DELETE FROM Schedule;
--DBCC CHECKIDENT ('Schedule', RESEED, 0);

SELECT * FROM Schedule; 